app/Models/RegisterModel.php

INSERT INTO `register` (`userName`, `userPassword`, `email`, `uniId`, `activationDate`) VALUES ('kiboolif', '$2y$10$f/VkaGnzkuklCgrCw7TIaOZwzY6UWs3fwSEdrPvDaJbvI2Bq/nphm', 'root@gmail.com', '6579cba8777faf04ccabd8edf085e485', '2023-05-02 02:19:39')
---
  public function saveData($data){

    $builder=$this->conn->table('register');
    $res=$builder->insert($data);

SELECT `activationDate`, `uniId`, `status`
FROM `register`
WHERE `uniId` = '6579cba8777faf04ccabd8edf085e485'
---
  public function verifyId($id){
    $builder=$this->conn->table('register');
    $builder->select("activationDate,uniId,status");
    $builder->where("uniId",$id);
    $result=$builder->get();